#-------------------------------------# فلرة الكلام الوصخ
# مثال واحد
from clearAR import Word

text: str = 'اِعْتَرَفَ لَكُّ بِأَنْ الْحَيَاةَ? منْ غِيَرِكَ لَيْسَتْ حَيَاةُ فَكَيَّفَ ينْبِضُ قُلَّبُي وَكَيَّفَ يَشُعَّ النَّوَرُ مِنْ عَيْنِي وَكَيَّفَ أَعَيْشُ يَوْمِي وَاُنْت لَسْت معَِي?'

if Word.BadWord(text)==True:
    print("كلمه عيب")
else:
    print("كلمه نظيفه")

#-------------------------------------# فلرة الكلام الوصخ

#-------------------------------------# فلرة الجمل من الحركات
# مثال اثنين

from clearAR import Word

text: str = 'اِعْتَرَفَ لَكُّ بِأَنْ الْحَيَاةَ? منْ غِيَرِكَ لَيْسَتْ حَيَاةُ فَكَيَّفَ ينْبِضُ قُلَّبُي وَكَيَّفَ يَشُعَّ النَّوَرُ مِنْ عَيْنِي وَكَيَّفَ أَعَيْشُ يَوْمِي وَاُنْت لَسْت معَِي?'

print(Word.strip_tatweel(text))


#-------------------------------------# فلرة الجمل من الحركات
